{
  "manifest": {
    "translationVersion": -639075600000,
    "pluginVersion": "2.1.14"
  },
  "description": {
    "original": "Allows for manual and automatic, config-driven reordering and sorting of files and folders in File Explorer",
    "translation": "允许在文件资源管理器中手动和自动地、基于配置的重新排序和整理文件和文件夹。"
  },
  "dict": {
    ".setText(`Custom sort:${this.settings.suspended?\"OFF\":\"ON\"}`)": ".setText(`自定义排序:${this.settings.suspended?\"关闭\":\"开启\"}`)",
    ".setName(\"Path or name of additional note(s) containing sorting specification\")": ".setName(\"包含排序规范的附加笔记的路径或名称\")",
    ".setName(\"Name of index note (Folder Notes support)\")": ".setName(\"索引笔记的名称 (支持文件夹笔记)\")",
    ".setName(\"Enable the status bar entry\")": ".setName(\"启用状态栏条目\")",
    ".setName(\"Enable notifications of plugin state changes\")": ".setName(\"启用插件状态更改的通知\")",
    ".setName(\"Enable notifications of plugin state changes for mobile devices only\")": ".setName(\"仅在移动设备上启用插件状态更改的通知\")",
    ".setName(\"Enable File Explorer context submenu`Custom sort:`\")": ".setName(\"启用文件资源管理器上下文子菜单`自定义排序:`\")",
    ".setName(\"Automatic integration with core Bookmarks plugin (for indirect drag & drop ordering)\")": ".setName(\"与核心书签插件自动集成 (用于间接拖放排序)\")",
    ".setName(\"Name of the group in Bookmarks from which to read the order of items\")": ".setName(\"从书签中读取项目顺序的组的名称\")",
    ".setName(\"Context menus for Bookmarks integration\")": ".setName(\"书签集成的上下文菜单\")",
    ".setDesc(\"The status bar entry shows the label `Custom sort:ON` or `Custom sort:OFF`, representing the current state of the plugin.\")": ".setDesc(\"状态栏条目显示标签 `自定义排序:开启` 或 `自定义排序:关闭`，表示插件的当前状态。\")",
    ".setDesc(\"The plugin can show notifications about its state changes: e.g. when successfully parsed and applied the custom sorting specification, or, when the parsing failed. If the notifications are disabled, the only indicator of plugin state is the ribbon button icon. The developer console presents the parsing error messages regardless if the notifications are enabled or not.\")": ".setDesc(\"插件可以显示关于其状态变化的通知：例如，成功解析并应用了自定义排序规范时，或者解析失败时。如果禁用了通知，插件状态的唯一指示符就是丝带按钮图标。无论是否启用了通知，开发者控制台都会显示解析错误信息。\")",
    ".setDesc(\"See above.\")": ".setDesc(\"见上文。\")",
    ".setDesc(\"Gives access to operations relevant for custom sorting, e.g. applying custom sorting.\")": ".setDesc(\"提供对自定义排序相关操作的访问，例如应用自定义排序。\")",
    ".setPlaceholder(\"e.g. sorting-configuration\")": ".setPlaceholder(\"例如. 排序配置\")",
    ".setPlaceholder(\"e.g. _about_ or index\")": ".setPlaceholder(\"例如. _about_ 或 索引\")",
    ".setPlaceholder(\"e.g. Group for sorting\")": ".setPlaceholder(\"例如. 用于排序的组\")",
    ".createEl(\"h2\",{text:\"Bookmarks integration\"})": ".createEl(\"h2\",{text:\"书签集成\"})",
    ".setTitle(\"Custom sort:\")": ".setTitle(\"自定义排序:\")",
    "name:\"Enable and apply the custom sorting, (re)parsing the sorting configuration first. Sort-on.\"": "name:\"启用并应用自定义排序，首先(重新)解析排序配置。排序开启。\"",
    "name:\"Suspend the custom sorting. Sort-off.\"": "name:\"暂停自定义排序。排序关闭。\"",
    "\"Enable <i>Custom-sort: bookmark for sorting</i> and <i>Custom-sort: bookmark+siblings for sorting</i> (and related) entries in context menu in File Explorer\")": "\"启用文件资源管理器上下文菜单中的 <i>自定义排序: 书签排序</i> 和 <i>自定义排序: 书签+同级排序</i> （及相关）项\")",
    "\"A note name or note path to scan (YAML frontmatter) for sorting specification in addition to the `sortspec` notes and Folder Notes.<br> The `.md` filename suffix is optional.<br><p>NOTE: After updating this setting remember to refresh the custom sorting via clicking on the ribbon icon or via the <b>sort-on</b> command or by restarting Obsidian or reloading the vault</p>\")": "\"要扫描以获取排序规范的笔记名称或笔记路径（YAML 前置元数据），除了 `sortspec` 笔记和文件夹笔记。<br>`.md` 文件名后缀是可选的。<br><p>注意：更新此设置后，请记得通过点击丝带图标或使用 <b>sort-on</b> 命令或重启 Obsidian 或重新加载金库来刷新自定义排序。</p>\")",
    "'If you employ the <i>Index-File based</i> approach to folder notes (as documented in <a href=\"https://github.com/aidenlx/alx-folder-note/wiki/folder-note-pref\">Aidenlx Folder Note preferences</a>) enter here the index note name, e.g. <b>_about_</b> or <b>index</b><br> The `.md` filename suffix is optional.<br>This will tell the plugin to read sorting specs and also folders metadata from these files.<br></br>The <i>Inside Folder, with Same Name Recommended</i> mode of Folder Notes is handled automatically, no additional configuration needed.</p><p>NOTE: After updating this setting remember to refresh the custom sorting via clicking on the ribbon icon or via the <b>sort-on</b> command or by restarting Obsidian or reloading the vault</p>')": "'如果您采用基于 <i>索引文件</i> 的文件夹笔记方法（如 <a href=\"https://github.com/aidenlx/alx-folder-note/wiki/folder-note-pref\">Aidenlx 文件夹笔记偏好设置</a> 所述），请在此处输入索引笔记名称，例如 <b>_about_</b> 或 <b>index</b><br>`.md` 文件名后缀是可选的。<br>这将告诉插件从这些文件中读取排序规范和文件夹元数据。<br></br>文件夹笔记的 <i>推荐使用相同名称的内部文件夹</i> 模式会自动处理，无需额外配置。</p><p>注意：更新此设置后，请记得通过点击丝带图标或使用 <b>sort-on</b> 命令或重启 Obsidian 或重新加载金库来刷新自定义排序。</p>')",
    "`If enabled, order of files and folders in File Explorer will reflect the order of bookmarked items in the bookmarks (core plugin) view. Automatically, without any need for sorting configuration. At the same time, it integrates seamlessly with <pre style=\"display: inline;\">sorting-spec:</pre> configurations and they can nicely cooperate.<br><p>To separate regular bookmarks from the bookmarks created for sorting, you can put the latter in a separate dedicated bookmarks group. The default name of the group is '<i>`+xt.bookmarksGroupToConsumeAsOrderingReference+`</i>' and you can change the group name in the configuration field below.<br>If left empty, all the bookmarked items will be used to impose the order in File Explorer.</p><p>More information on this functionality in the <a href=\"https://github.com/SebastianMC/obsidian-custom-sort/blob/master/docs/manual.md#bookmarks-plugin-integration\">manual</a> of this custom-sort plugin.</p>`)": "`如果启用，文件资源管理器中的文件和文件夹顺序将反映书签（核心插件）视图中标记项目的顺序。自动地，无需任何排序配置。同时，它与 <pre style=\"display: inline;\">sorting-spec:</pre> 配置无缝集成，可以很好地协同工作。<br><p>为了将常规书签与为排序创建的书签区分开来，您可以将后者放入一个单独的专用书签组。默认的组名是 '<i>`+xt.bookmarksGroupToConsumeAsOrderingReference+`</i>'，您可以在下面的配置字段中更改组名。<br>如果留空，则所有标记的项目都将用于确定文件资源管理器中的顺序。</p><p>有关此功能的更多信息，请参阅此自定义排序插件的<a href=\"https://github.com/SebastianMC/obsidian-custom-sort/blob/master/docs/manual.md#bookmarks-plugin-integration\">手册</a>。</p>`)"
  }
}