{
    "manifest": {
        "author": "Fendi",
        "version": "1.0.0"
    },
    "dict": {
        "ui=\"File Tree\"": "ui=\"文件树\"",
        "\"aria-label\":\"Close File Pane\"": "\"aria-label\":\"关闭文件面板\"",
        "\"aria-label\":\"Go Back to Folder View\"": "\"aria-label\":\"返回文件夹视图\"",
        "\"aria-label\":\"Reveal Active File\"": "\"aria-label\":\"显示活跃的文件\"",
        "\"aria-label\":\"Hide Files from Sub-Folders\"": "\"aria-label\":\"隐藏子文件夹中的文件\"",
        "\"aria-label\":\"Show Files from Sub-Folders\"": "\"aria-label\":\"显示子文件夹中的文件\"",
        "\"aria-label\":\"Search File by Name or Tag\"": "\"aria-label\":\"按名称或标记搜索文件\"",
        "\"aria-label\":\"Create a Note\"": "\"aria-label\":\"创建笔记\"",
        "text:\"General\"": "text:\"常规\"",
        "setName(\"Evernote View\")": "setName(\"全景视图\")",
        "setDesc(\"Turn on if you want to see the folders and files in a single view without switching between views. Similar experience to Evernote.\")": "setDesc(\"如果要在单个视图中查看文件夹和文件而不在视图之间切换，请启用此选项。与Evernote类似的体验。\")",
        "setName(\"Ribbon Icon\")": "setName(\"功能区图标\")",
        "setDesc(\"Turn on if you want Ribbon Icon for activating the File Tree.\")": "setDesc(\"如果要激活文件树，请启用功能区图标。\")",
        "{text:\"Folder Pane Settings\"}": "{text:\"文件夹面板设置\"}",
        "setName(\"Folder Icons\")": "setName(\"文件夹图标\")",
        "(\"Change the default folder icons your preferred option\")": "(\"将默认文件夹图标更改为首选选项\")",
        "setName(\"Folder Count\")": "setName(\"文件夹计数\")",
        "setDesc(\"Turn on if you want see the number of notes/files under file tree.\")": "setDesc(\"如果要查看文件树下的笔记/文件数，请启用该选项。\")",
        "setName(\"Folder Count Details\")": "setName(\"文件夹计数详细信息\")",
        "setDesc(\"Select which files you want to be included into count\")": "setDesc(\"选择要包含在计数项中的文件\")",
        "setName(\"Folder Note\")": "setName(\"文件夹备注\")",
        "setDesc(`Turn this option on if you want to create Folder Note same as Folder Note Plugin.                 By default, Click will open the list of files. You need to use \"Shift+Click\" to open the folder note. If folder has a folder note,                 you will see an arrow icon on the right side of folder. The note created as a folder note is hidden in the file list.`)": "setDesc(`如果要创建与文件夹注释插件相同的文件夹备注，请启用此选项。默认情况下，单击将打开文件列表。您需要使用“Shift+单击”打开文件夹备注。如果文件夹中有文件夹备注，您将在文件夹的右侧看到一个箭头图标。创建的文件夹备注会隐藏在文件列表中。`)",
        "text:\"File Pane Settings\"": "text:\"文件面板设置\"",
        "setName(\"Include Files From Subfolders to the File List\")": "setName(\"将子文件夹中的文件包括到文件列表中\")",
        "setDesc(\"Turn on this option if you want to see the list of files from all subfolders in addition to the selected folder\")": "setDesc(\"如果要查看 除选定文件夹外所有子文件夹中的文件列表，请启用此选项\")",
        "setName(\"Toggle Button for Include Files from Subfolders\")": "setName(\"点击按钮将查看 子文件夹中包含的文件\")",
        "setDesc('Turn on this option if you want to have an additional button on the top of the file list to toggle \"Include Files From Subfolders\"')": "setDesc('如果希望在文件列表顶部有一个附加按钮进行切换，请启用此选项')",
        "setName(\"Reveal Active File in File Tree Button\")": "setName(\"显示 “在文件树中查看活动文件” 的按钮\")",
        "setDesc('Turn on this option if you want to have an additional button to reveal the active file in the file tree. It will set the folder and file pane accordingly.\"')": "setDesc('如果希望有一个附加按钮显示文件树中的活动文件，请启用此选项。它将相应地设置文件夹和文件面板。\"')",
        "setName(\"Search in File List\")": "setName(\"在文件列表中搜索\")",
        "setDesc(\"Turn on this option if you want to enable search function to filter files by name.\")": "setDesc(\"如果要启用按名称筛选文件的搜索功能，请启用此选项。\")",
        "setName(\"All & Tag Search only in Focused Folder\")": "setName(\"在整库或当前文件夹中搜索标签\")",
        "setDesc('\"all:\" and \"tag:\" searches by default looks for all files in your vault. Turn on this option if you want search only in Focused Folder')": "setDesc('\"all:\" and \"tag:\"默认情况下，搜索会查找库中的所有文件。如果您只希望在当前文件夹中进行搜索，请启用此选项')",
        "setName(\"Sort Files By\")": "setName(\"文件排序依据\")",
        "setDesc(\"Select your preference how the files should be sorted in the file list\")": "setDesc(\"在文件列表中选择您的首选排序方式\")",
        "setName(\"Preview File on Hover\")": "setName(\"悬停时预览文件\")",
        "setDesc(\"Turn on if you want to preview the files once you hover on them within the file list.\")": "setDesc(\"如果要在文件列表中的文件上悬停后预览这些文件，请启用该选项。\")",
        "setName(\"Fixed Buttons and Header in File Pane\")": "setName(\"在文件面板中锁定按钮和标题\")",
        "setDesc(\"Turn on if you want buttons and header to be not scrolled within the file list.\")": "setDesc(\"如果不想在文件列表中滚动按钮和标题，请启用该选项。\")",
        "text:\"File Creation\"": "text:\"创建文件\"",
        "text:\"The settings below are only applicable if the plus (+) button within the file pane of the plugin is used.\"": "text:\"以下设置仅在使用文件面板中的加号(+)按钮时适用。\"",
        "setName(\"Created information in YAML\")": "setName(\"在YAML中创建信息\")",
        "setDesc(\"Turn on if you want plugin to include created YAML key with the time of creation\")": "setDesc(\"如果希望插件在创建时包含已创建的YAML信息，请启用该选项\")",
        "setName(\"Set File Name as Header 1\")": "setName(\"将文件名设置为标题1\")",
        "setDesc(\"Turn on if you want plugin to add the initial file name as main header in the created file.\")": "setDesc(\"如果希望插件将初始文件名作为第1标题添加到创建的文件中，请启用该选项。\")",
        "text:\"Exclude Settings\"": "text:\"排除设置\"",
        "setName(\"Excluded File Extensions\")": "setName(\"排除的文件扩展名\")",
        "setDesc(`Provide extension of files, which you want to exclude from listing in file tree, divided by comma. i.e. 'png, pdf, jpeg'.            You need to reload the vault or use \"Reload File Tree\" button below to make changes effective.`)": "setDesc(`提供文件扩展名，希望在文件树中不显示以下扩展名，如'png, pdf, jpeg'。您需要重新加载库或使用下面的“重新加载文件树”按钮，以使更改有效。`)",
        "setName(\"Excluded Folder Paths\")": "setName(\"排除的文件夹路径\")",
        "setDesc(`Provide full path of folders, which you want to exclude from listing in file tree, divided by comma. i.e. 'Personal/Attachments, Work/Documents/Folders'.            All subfolders are going to be excluded, as well. You need to reload the vault or use \"Reload File Tree\" button below to make changes effective.`)": "setDesc(`提供文件夹的完整路径，希望排除在文件树中的文件夹。i例： 'Personal/Attachments, Work/Documents/Folders'。所有的子文件夹也将被排除在外。您需要重新加载库或使用下面的“重新加载文件树”按钮，以使更改有效。`)",
        "text:\"Clear Data\"": "text:\"清除数据\"",
        "setName(\"Clear All Cache Data\")": "setName(\"清除所有缓存数据\")",
        "setDesc(`This button will clear the following cache data: \"Last position of the divider\" & \"List of expanded folders in the folder pane\",                 & \"Last active folder path\". It will not touch your settings above and list of pinned files. It is recommended to do this clearing once in a while.`)": "setDesc(`此按钮将清除以下缓存数据：“分隔符的最后位置”&“文件夹窗格中展开文件夹的列表”，“上一个活动文件夹路径”等。它不会触及上面的设置和锁定文件列表。建议偶尔做一次这种清除。`)",
        "setName(\"Clear Pinned Files\")": "setName(\"清除锁定的文件\")",
        "setDesc(\"This button will clear the pinned files in the file list pane.\")": "setDesc(\"此按钮将清除“文件列表”窗格中的锁定文件。\")",
        "setName(\"Show Root Folder\")": "setName(\"显示根文件夹\")"
    }
}
