{
    "manifest": {
        "author": "",
        "version": "1.0.0"
    },
    "dict": {
        "description:\"Auto-correct misspellings in regular text, but not code blocks, math blocks, YAML, or tags\"": "description:\"自动更正常规文本中的拼写错误，但不更正代码块, 数学块, YAML 或标签\"",
        "description:\"Auto-correct misspellings keeps first letter's case\"": "description:\"自动更正拼写错误（保留第一个字母的大小写）\"",
        "description:\"Links should not be auto-corrected\"": "description:\"链接不应自动更正\"",
        "description:\"A comma separated list of lowercased words to ignore when auto-correcting\"": "description:\"自动更正时要忽略以逗号分隔的小写单词列表\"",
        "description:\"Line being pasted into regular text does not get blockquotified with current line being `Part 1 of the sentence`\"": "description:\"粘贴到常规文本中的行不能被块引用，因为当前行是句子的第1部分\"",
        "description:\"Line being pasted into a blockquote gets blockquotified with current line being `> > `\"": "description:\"粘贴到块引用中的行会被当前行块引用，当前行是 `> > `\"",
        "description:\"The style of capitalization to use\"": "description:\"要使用的大写样式\"",
        "description:\"Capitalize Using Title Case Rules\"": "description:\"使用标题大小写规则进行大写\"",
        "description:\"Only capitalize the first letter\"": "description:\"只大写第一个字母\"",
        "description:\"Only apply title case style to words that are all lowercase\"": "description:\"只将标题大小写样式应用于全部小写的单词\"",
        "description:\"A comma separated list of words to ignore when capitalizing\"": "description:\"在处理大写时忽略以逗号分隔的单词列表\"",
        "description:\"A comma separated list of words to keep lowercase\"": "description:\"以逗号分隔的单词列表，要保持小写\"",
        "description:\"Remove blank lines at the start and end of the YAML\"": "description:\"删除 YAML 开头和结尾的空白行\"",
        "description:\"Remove blank lines anywhere in YAML with inner new lines set to true\"": "description:\"删除 YAML 中任意位置的空行，并将 inner new lines 设置为 true\"",
        "description:\"Remove new lines that are not at the start or the end of the YAML\"": "description:\"删除不在 YAML 开头或结尾的新行\"",
        "description:\"Converting spaces to tabs with `tabsize = 3`\"": "description:\"将空格转换为制表符 `制表符大小 = 3`\"",
        "description:\"Number of spaces that will be converted to a tab\"": "description:\"将被转换为制表符的空格数\"",
        "description:\"Emphasis indicators should use underscores when style is set to 'underscore'\"": "description:\"当样式设置为 'underscore' 时，强调指示器应使用下划线\"",
        "description:\"Emphasis indicators should use asterisks when style is set to 'asterisk'\"": "description:\"当样式设置为 'asterisk' 时，强调指示器应使用星号\"",
        "description:\"Emphasis indicators should use consistent style based on first emphasis indicator in a file when style is set to 'consistent'\"": "description:\"当样式设置为 'consistent' 时，强调指示器应根据文件中的第一个强调指示器使用一致的样式\"",
        "description:\"The style used to denote emphasized content\"": "description:\"用于表示强调内容的样式\"",
        "description:\"Makes sure the first instance of emphasis is the style that will be used throughout the document\"": "description:\"确保强调的第一个实例是将在整个文档中使用的样式\"",
        "description:\"Makes sure * is the emphasis indicator\"": "description:\"确保 * 是加粗指示符\"",
        "description:\"Makes sure _ is the emphasis indicator\"": "description:\"确保 _ 是斜体指示符\"",
        "description:\"Blockquotes that start a document do not get an empty line before them.\"": "description:\"文档开头的块引号前面不会有空行。\"",
        "description:\"Blockquotes that end a document do not get an empty line after them.\"": "description:\"文档结尾的块引号后面不会有空行。\"",
        "description:\"Blockquotes that are nested have the proper empty line added\"": "description:\"嵌套的块引号添加了适当的空行\"",
        "description:\"Fenced code blocks that start a document do not get an empty line before them.\"": "description:\"开始文档的分隔代码块前面没有空行。\"",
        "description:\"Fenced code blocks that end a document do not get an empty line after them.\"": "description:\"结束文档的有围栏的代码块后面不会有空行。\"",
        "description:\"Fenced code blocks that are in a blockquote have the proper empty line added\"": "description:\"块引号中的带围栏的代码块添加了正确的空行\"",
        "description:\"Nested fenced code blocks get empty lines added around them\"": "description:\"嵌套的封闭代码块会在其周围添加空行\"",
        "description:\"Math blocks that start a document do not get an empty line before them.\"": "description:\"开始文档的数学块前面没有空行。\"",
        "description:\"Math blocks that are singe-line are updated based on the value of `Number of Dollar Signs to Indicate a Math Block` (in this case its value is 2)\"": "description:\"单行的数学块基于【表示数学块的美元符号数】的值进行更新（在这种情况下，值为2）\"",
        "description:\"Math blocks that end a document do not get an empty line after them.\"": "description:\"结束文档的数学块后面不会有空行。\"",
        "description:\"Math blocks that are not at the start or the end of the document will have an empty line added before and after them\"": "description:\"不在文档开头或结尾的数学块将在其前后添加空行\"",
        "description:\"Math blocks in callouts or blockquotes have the appropriately formatted blank lines added\"": "description:\"标注或块引号中的数学块添加了格式适当的空行\"",
        "description:\"Tables that start a document do not get an empty line before them.\"": "description:\"开始文档的表前面没有空行。\"",
        "description:\"Tables that end a document do not get an empty line after them.\"": "description:\"结束文档的表后面不会有空行。\"",
        "description:\"Tables that are not at the start or the end of the document will have an empty line added before and after them\"": "description:\"不在文档开头或结尾的表将在其前后添加空行\"",
        "description:\"Tables in callouts or blockquotes have the appropriately formatted blank lines added\"": "description:\"标注或块引号中的表添加了格式适当的空行\"",
        "description:\"YAML without anything to escape\"": "description:\"YAML 无需转义处理\"",
        "description:\"YAML with unescaped values\"": "description:\"YAML 具有未转义的值\"",
        "description:\"YAML with unescaped values with arrays\"": "description:\"带有数组型未转义值的 YAML\"",
        "description:'Tries to escape array values assuming that an array starts with \"[\", ends with \"]\", and has items that are delimited by \",\".'": "description:'尝试转义数组值，假设数组以 [ 开头，以 ] 结尾，并且包含由 \",\" 分隔的项目。'",
        "description:\"Inserts an H1 heading\"": "description:\"插入 H1标题\"",
        "description:\"Inserts heading after YAML front matter\"": "description:\"在 YAML 后插入标题\"",
        "description:\"Placing footnotes after punctuation.\"": "description:\"在标点符号后放置脚注。\"",
        "description:\"A footnote at the start of a task is not moved to after the punctuation\"": "description:\"任务开头的脚注不会移动到标点符号之后\"",
        "description:\"Force YAML keys to be escaped with double quotes where not already escaped with `Force Yaml Escape on Keys = 'key'\\\\n'title'\\\\n'bool'`\"": "description:\"强制YAML键在没有转义的地方用双引号转义，基于 `强制转义的键 = 'key'\\\\n'title'\\\\n'bool'`\"",
        "description:\"Uses the YAML escape character on the specified YAML keys separated by a new line character if it is not already escaped. Do not use on YAML arrays.\"": "description:\"在指定的YAML键上使用YAML转义符，如果尚未转义，则用换行符分隔。不要在YAML数组上使用。\"",
        "description:\"Format Tags in YAML frontmatter\"": "description:\"在 YAML frontmatter 中设置标签格式\"",
        "description:\"Format tags in array\"": "description:\"格式化数组中的标签\"",
        "description:\"Format tags in array with `tag` as the tags key\"": "description:\"用 `tag` 作为标签键格式化数组中的标签\"",
        "description:\"Format tags in list\"": "description:\"格式化列表中的标签\"",
        "description:\"Format tags as a single-line array delimited by spaces and aliases as a multi-line array and format the key `test` to be a single-line array\"": "description:\"将标记格式化为由空格分隔的单行数组，将别名格式化为多行数组，并将键 `test` 格式化为单行数组\"",
        "description:\"Format tags as a single string with space delimiters, ignore aliases, and format regular yaml arrays as single-line arrays\"": "description:\"使用空格分隔符将标签格式化为单个字符串，忽略别名，并将常规 yaml 数组格式化为单行数组\"",
        "description:\"Arrays with dictionaries in them are ignored\"": "description:\"忽略其中包含字典的数组\"",
        "description:\"Turns on formatting for the yaml aliases section. You should not enable this option alongside the rule `YAML Title Alias` as they may not work well together or they may have different format styles selected causing unexpected results.\"": "description:\"打开yaml别名部分的格式。您不应该同时启用【YAML标题别名】规则，因为它们可能无法同步工作或者选择了不同的格式样式，从而导致意外的结果。\"",
        "description:\"Turns on formatting for the yaml tags section.\"": "description:\"打开yaml标签部分的格式。\"",
        "description:\"The style of other yaml arrays that are not `tags`, `aliases` or  in `Force key values to be single-line arrays` and `Force key values to be multi-line arrays`\"": "description:\"不是 `标签` 、`别名` 或 `强制键值为单行数组` 和 `强制键值为多行数组` 的其他Yaml数组的样式\"",
        "description:\"Turns on formatting for regular yaml arrays\"": "description:\"开启常规 Yaml 数组的格式设置\"",
        "description:\"Forces the yaml array for the new line separated keys to be in single-line format (leave empty to disable this option)\"": "description:\"强制将 Yaml 中的多行数组转换为单行格式（留空以禁用此选项）\"",
        "description:\"Forces the yaml array for the new line separated keys to be in multi-line format (leave empty to disable this option)\"": "description:\"强制将 Yaml 中的多行数组转换为多行格式（留空以禁用此选项）\"",
        "description:\"Skipped headings in sections that would be decremented will result in those headings not having the same meaning\"": "description:\"跳过省略部分中的标题，将导致这些标题具有不同的含义\"",
        "description:\"When `Start Header Increment at Heading Level 2 = true`, H1s become H2s and the other headers are incremented accordingly\"": "description:\"当 `级别从标题2开始增量 = true` 时，H1变为H2，其他标题级别也相应增加\"",
        "description:\"Makes heading level 2 the minimum heading level in a file for header increment and shifts all headings accordingly so they increment starting with a level 2 heading.\"": "description:\"使标题2成为文件中级别增量的最低标题级别，并相应地转换所有标题，使它们从级别2开始递增。\"",
        "description:\"Headings should be surrounded by blank lines\"": "description:\"标题应该用空行包围\"",
        "description:\"With `Bottom=false`\"": "description:\"当 `底部=false`\"",
        "description:\"Empty line before header and after Yaml is removed with `Empty Line Between Yaml and Header=true`\"": "description:\"当 `Yaml和标题之间的空行 = true` 时，删除标题前和标题后的空行。\"",
        "description:\"Insert a blank line after headings\"": "description:\"在标题后面插入空行\"",
        "description:\"Keep the empty line between the Yaml frontmatter and header\"": "description:\"在 Yaml 和标题之间保留空行\"",
        "description:\"Removes spaces prior to a heading\"": "description:\"删除标题前的空格\"",
        "description:\"Tags are not affected by this\"": "description:\"标签不受此影响\"",
        "description:\"Insert static lines into YAML frontmatter. Text to insert: `aliases:\\ntags: doc\\nanimal: dog`\"": "description:\"将静态线插入YAML。要插入的文本: `aliases:\\ntags: doc\\nanimal: dog`\"",
        "description:\"Text to insert into the YAML frontmatter\"": "description:\"要插入YAML的文本\"",
        "description:\"Appending a line break to the end of the document.\"": "description:\"在文档末尾附加一个换行符。\"",
        "description:\"Removing trailing line breaks to the end of the document, except one.\"": "description:\"删除文档末尾的多余换行符（保留一个）。\"",
        "description:\"Moving footnotes to the bottom\"": "description:\"脚注移到底部\"",
        "description:\"Moving math block indicator to its own line when `Number of Dollar Signs to Indicate a Math Block` = 2\"": "description:\"当 `表示数学块的美元符号数`= 2时，将数学块指示器移动到它自己的行\"",
        "description:\"Moving math block indicator to its own line when `Number of Dollar Signs to Indicate a Math Block` = 3 and opening indicator is on the same line as the start of the content\"": "description:\"当 `表示数学块的美元符号数`= 3且开始指示符与内容的开始在同一行时，将数学块指示符移动到它自己的行\"",
        "description:\"Moving math block indicator to its own line when `Number of Dollar Signs to Indicate a Math Block` = 2 and ending indicator is on the same line as the ending line of the content\"": "description:\"当 `指示数学块的美元符号数`= 2且结束指示符与内容的结束行在同一行时，将数学块指示符移动到它自己的行\"",
        "description:\"Move tags from body to Yaml with `Tags to ignore = 'ignored-tag'`\"": "description:\"使用 `要忽略的标记= 'ignored-tag '` 将标签从正文移动到Yaml\"",
        "description:\"Move tags to YAML frontmatter and then remove hashtags in body content tags when `Body tag operation = 'Remove hashtag'` and `Tags to ignore = 'yet-another-ignored-tag'`.\"": "description:\"当 `正文标签操作 = ' Remove hashtag '` 和 `要忽略的标签 = ' yet-another-ignored-tag '` 时，将标签移动到YAML中，然后删除正文内容标签中的hash tag。\"",
        "description:\"Move tags to YAML frontmatter and then remove body content tags when `Body tag operation = 'Remove whole tag'`.\"": "description:\"当 `正文标签操作='删除整个标签'` 时，将标签移动到YAML中，然后删除正文内容标签。\"",
        "description:\"What to do with non-ignored tags in the body of the file once they have been moved to the frontmatter\"": "description:\"如果文件正文中未被忽略的标签被移到前面，该如何处理它们\"",
        "description:\"Leaves tags in the body of the file alone\"": "description:\"将标签单独留在文件正文中\"",
        "description:\"Removes `#` from tags in content body after moving them to the YAML frontmatter\"": "description:\"将内容正文中的标签移动到YAML后，删除标签中的 `#` \"",
        "description:\"Removes the whole tag in content body after moving them to the YAML frontmatter. _Note that this removes the first space prior to the tag as well_\"": "description:\"将内容正文中的整个标签移动到YAML后，将其删除。_注意，这会删除标签前的第一个空格_\"",
        "description:\"The tags that will not be moved to the tags array or removed from the body content if `Remove the hashtag from tags in content body` is enabled. Each tag should be on a new line and without the `#`. **Make sure not to include the hashtag in the tag name.**\"": "description:\"如果启用了 `从内容正文中的标签中删除hashtag` ，则这些标签不会被移动到标签数组中，也不会从正文内容中删除。每个标签应该在新的一行，没有 `#` 。**确保标签名称中不包含标签。** \"",
        "description:\"Make sure that links are inside of angle brackets when not in single quotes('), double quotes(\\\"), or backticks(`)\"": "description:\"当链接不在单引号、双引号或反勾号中时，请确保链接在尖括号内\"",
        "description:`Angle brackets are added if the url is not the only text in the single quotes(') or double quotes(\")`": "description:`如果URL不是单引号或双引号中的唯一文本，则会前后添加尖括号`",
        "description:\"Multiple angle brackets at the start and or end of a url will be reduced down to 1\"": "description:\"URL开头和/或结尾有多个尖括号时，将减少到1个\"",
        "description:\"Ordered lists have list items set to ascending numerical order when Number Style is `ascending`.\"": "description:\"当数字样式为升序时，有序列表的列表项设置为升序数字顺序。\"",
        "description:\"Nested ordered lists have list items set to ascending numerical order when Number Style is `ascending`.\"": "description:\"当数字样式为升序时，嵌套有序列表将列表项设置为升序数字顺序。\"",
        "description:\"Ordered list in blockquote has list items set to '1.' when Number Style is `lazy`.\"": "description:\"块引用中的有序列表的列表项设置为 1 当数字样式为 `lazy` 时。\"",
        "description:\"Ordered list in blockquote has list items set to ascending numerical order when Number Style is `ascending`.\"": "description:\"当数字样式为升序时，块引用中的有序列表将列表项设置为升序数字顺序。\"",
        "description:\"Nested ordered list has list items set to '1)' when Number Style is `lazy` and Ordered List Indicator End Style is `)`.\"": "description:\"当数字样式为 `lazy` 且有序列表指示符结束样式为 ) 时，嵌套有序列表的列表项设置为 1) 。\"",
        "description:\"The number style used in ordered list indicators\"": "description:\"有序列表指示器中使用的数字样式\"",
        "description:\"Makes sure ordered list items are ascending (i.e. 1, 2, 3, etc.)\"": "description:\"确保有序列表项目是升序排列的（例1、2、3等。)\"",
        "description:\"Makes sure ordered list item indicators all are the number 1\"": "description:\"确保有序列表的行首符号均为数字 1\"",
        "description:\"The ending character of an ordered list indicator\"": "description:\"有序列表指示符的结束字符\"",
        "description:\"Makes sure ordered list items indicators end in '.' (i.e `1.`)\"": "description:\"确保有序列表项指示器以 '.' 为结尾（例 `1.`）\"",
        "description:\"Makes sure ordered list item indicators end in ')' (i.e. `1)`)\"": "description:\"确保有序列表项指示符以 ')' 结尾 （例 `1)` ）\"",
        "description:\"Paragraphs should be surrounded by blank lines\"": "description:\"段落应该由空行包围\"",
        "description:\"Line being pasted is left alone when current line has no checklist indicator in it: `Regular text here`\"": "description:\"当前行中没有清单指示器时，粘贴的行保持不变：`此处为常规文本` \"",
        "description:\"Line being pasted into a blockquote without a checklist indicator is left alone when it lacks a checklist indicator: `> > `\"": "description:\"当粘贴到没有清单标记的块引用中的行缺少清单标记时，该行将被保留: `> > `\"",
        "description:\"Line being pasted into a blockquote with a checklist indicator is has its checklist indicator removed when current line is: `> - [x] `\"": "description:\"当粘贴到带有核对列表指示符的块引用中的行将删除其核对列表指示符: `> - [x] `\"",
        "description:\"Line being pasted with a checklist indicator is has its checklist indicator removed when current line is: `- [ ] `\"": "description:\"当粘贴有核对列表标记的行将删除其核对列表标记: `- [ ] `\"",
        "description:\"Line being pasted is left alone when current line has no list indicator in it: `Regular text here`\"": "description:\"当前行中没有列表指示符时，粘贴的行保持不变: `此处为常规文本` \"",
        "description:\"Line being pasted into a blockquote without a list indicator is left alone when it lacks a list indicator: `> > `\"": "description:\"当粘贴到没有列表指示符的块引用中的行缺少列表指示符时，该行将被保留: `> > `\"",
        "description:\"Line being pasted into a blockquote with a list indicator is has its list indicator removed when current line is: `> * `\"": "description:\"当粘贴到带有列表指示符的块引用中的行将删除其列表指示符: `> * `\"",
        "description:\"Line being pasted with a list indicator is has its list indicator removed when current line is: `+ `\"": "description:\"当正在粘贴列表标记的行的列表标记被删除: `+ `\"",
        "description:\"Replacing three consecutive dots with an ellipsis even if spaces are present\"": "description:\"用省略号替换三个连续的点，即使存在空格\"",
        "description:\"Replacing three consecutive dots with an ellipsis.\"": "description:\"用省略号替换三个连续的点。\"",
        "description:\"Re-indexing footnotes after having deleted previous footnotes\"": "description:\"删除先前脚注后重新索引脚注\"",
        "description:\"Re-indexing footnotes after inserting a footnote between\"": "description:\"在脚注之间插入脚注后重新索引脚注\"",
        "description:\"Re-indexing duplicate footnote keys\"": "description:\"重新索引重复的脚注键\"",
        "description:\"Removing consecutive list markers.\"": "description:\"正在删除连续的列表标记。\"",
        "description:\"Removes empty list markers.\"": "description:\"删除空列表标记。\"",
        "description:\"Removes empty ordered list markers.\"": "description:\"删除有序列表中空项的标记。\"",
        "description:\"Removes empty checklist markers.\"": "description:\"删除检查清单中空项的标记。\"",
        "description:\"Removes empty list, checklist, and ordered list markers in callouts/blockquotes\"": "description:\"删除标注/块引号中的空列表, 清单和有序列表标记\"",
        "description:\"Removing hyphenated line breaks.\"": "description:\"正在删除连字符的换行符。\"",
        "description:\"Remove hyphen in content to paste\"": "description:\"删除要所粘内容中的连字符\"",
        "description:\"Removes leading spaces and newline characters\"": "description:\"删除前导空格和换行符\"",
        "description:\"Leaves leading tabs alone\"": "description:\"只保留前导制表符\"",
        "description:\"Footnote reference removed\"": "description:\"脚注引用已删除\"",
        "description:\"Space in regular markdown link text\"": "description:\"常规 MarkDown 链接文本中的空格\"",
        "description:\"Space in wiki link text\"": "description:\"wiki 链接文本中的空格\"",
        "description:\"Multiple blanks lines condensed down to one\"": "description:\"多个空行压缩为一行\"",
        "description:\"Text with only one blank line in a row is left alone\"": "description:\"一行中只有一个空行的文本将被单独保留\"",
        "description:\"Removing double and triple space.\"": "description:\"删除连续的两个或多个空格。\"",
        "description:\"Remove Spaces and Tabs around Fullwidth Characters\"": "description:\"删除全角字符周围的空格和制表符\"",
        "description:\"Fullwidth Characters in List Do not Affect List Markdown Syntax\"": "description:\"列表中的全角字符不影响列表(MD 语法)\"",
        "description:\"Removes punctuation from the end of a heading\"": "description:\"删除标题行末尾的标点符号\"",
        "description:\"HTML Entities at the end of a heading is ignored\"": "description:\"忽略标题末尾的 HTML 语法\"",
        "description:\"The trailing punctuation to remove from the headings in the file.\"": "description:\"指定要从文件标题中删除的末尾标点。\"",
        "description:'Removes the values specified in `YAML Keys to Remove` = \"status:\\nkeywords\\ndate\"'": "description:'移除 `要删除的YAML键` = \"status:\\nkeywords\\ndate\" 中指定的值'",
        "description:\"The yaml keys to remove from the yaml frontmatter with or without colons\"": "description:\"要从带有或不带有冒号的YMAL中删除的yaml键\"",
        "description:\"Space between Chinese and English\"": "description:\"中英文之间的空格\"",
        "description:\"Space between Chinese and link\"": "description:\"中文和链接之间的空格\"",
        "description:\"Space between Chinese and inline code block\"": "description:\"中文和内联代码块之间的空格\"",
        "description:\"No space between Chinese and English in tag\"": "description:\"标签里的中英文之间没有空格\"",
        "description:\"Make sure that spaces are not added between italics and chinese characters to preserve markdown syntax\"": "description:\"确保斜体和中文之间没有添加空格，以保留 MD 语法\"",
        "description:\"Images and links are ignored\"": "description:\"忽略图像和链接\"",
        "description:\"Space between CJK and English\"": "description:\"CJK 和英语之间的空格\"",
        "description:\"Strong indicators should use underscores when style is set to 'underscore'\"": "description:\"当样式设置为 'underscore' 时，强指示器应使用下划线\"",
        "description:\"Strong indicators should use asterisks when style is set to 'asterisk'\"": "description:\"当样式设置为 'asterisk' 时，强调指示器应使用星号\"",
        "description:\"Strong indicators should use consistent style based on first strong indicator in a file when style is set to 'consistent'\"": "description:\"当样式设置为 'consistent' 时，应基于文件中的第一个强调指示器使用一致的强调样式\"",
        "description:\"The style used to denote strong/bolded content\"": "description:\"用于表示强调/粗体内容的样式\"",
        "description:\"Makes sure the first instance of strong is the style that will be used throughout the document\"": "description:\"确保强调的第一个实例是将在整个文档中使用的样式\"",
        "description:\"Makes sure ** is the strong indicator\"": "description:\"确保 ** 是粗体的指示符\"",
        "description:\"Makes sure __ is the strong indicator\"": "description:\"确保 __ 是粗体的指示符\"",
        "description:\"Removes trailing spaces and tabs.\"": "description:\"删除尾随空格和制表符。\"",
        "description:\"With `Two Space Linebreak = true`\"": "description:\"当 `两个空格换行 = true`\"",
        "description:'Ignore two spaces followed by a line break (\"Two Space Rule\").'": "description:'忽略后跟换行符的两个空格 (\"两个空格规则\")。'",
        "description:\"Make sure two spaces are added to the ends of lines that have content on it and the next line for lists, blockquotes, and paragraphs\"": "description:\"确保在有内容的行尾添加两个空格，并在下一行添加列表,  块引号和段落内容\"",
        "description:\"Unordered lists have their indicator updated to `*` when `List item style = 'consistent'` and `*` is the first unordered list indicator\"": "description:\"当 `列表项目样式 = 'consistent'` 和 `*` 是第一个无序列表指示器，无序列表的指示器更新为 `*` \"",
        "description:\"Unordered lists have their indicator updated to `-` when `List item style = '-'`\"": "description:\"当 `列表项目样式='-'` 时，无序列表的指示器更新为 `-` \"",
        "description:\"Unordered lists have their indicator updated to `*` when `List item style = '*'`\"": "description:\"当 `列表项目样式='*'` 时，无序列表的指示器更新为 `*` \"",
        "description:\"Unordered list in blockquote has list item indicators set to `+` when `List item style = '-'`\"": "description:\"当 `列表项目样式='-'` 时，引用块中的无序列表的列表项指示符设置为 `+` \"",
        "description:\"The list item style to use in unordered lists\"": "description:\"无序列表中使用的列表项样式\"",
        "description:\"Makes sure unordered list items use a consistent list item indicator in the file which will be based on the first list item found\"": "description:\"确保无序列表项在文件中使用一致的列表项指示符，该指示符将基于找到的第一个列表项\"",
        "description:\"The order in which to sort keys with one on each line where it sorts in the order found in the list\"": "description:\"对键进行排序的顺序，每行一个键，按照列表中的顺序进行排序\"",
        "description:\"YAML Key Priority Sort Order is placed at the start of the YAML frontmatter\"": "description:\"YAML键优先排序顺序放在YAML前沿问题的开始\"",
        "description:\"The way in which to sort the keys that are not found in the YAML Key Priority Sort Order text area\"": "description:\"在YAML键优先级排序顺序文本区域中找不到的键的排序方式\"",
        "description:\"No sorting other than what is in the YAML Key Priority Sort Order text area\"": "description:\"除 YAML 键优先级排序文本区域中的内容外，不进行其它排序\"",
        "description:\"Sorts the keys based on key value from a to z\"": "description:\"根据键值从 a 到 z 对键进行排序\"",
        "description:\"Sorts the keys based on key value from z to a\"": "description:\"根据键值从 z 到 a 对键进行排序\"",
        "description:\"Adds a header with the date.\"": "description:\"添加带有日期的标题。\"",
        "description:\"dateCreated option is false\"": "description:\"dateCreated 选项为 false\"",
        "description:\"Date Created Key is set\"": "description:\"设置 创建日期 键\"",
        "description:\"Date Modified Key is set\"": "description:\"设置 修改日期 键\"",
        "description:\"Insert the file creation date\"": "description:\"插入文件的创建日期\"",
        "description:\"Which YAML key to use for creation date\"": "description:\"用于 YAML 创建日期键\"",
        "description:\"Insert the date the file was last modified\"": "description:\"插入文件的上次修改日期\"",
        "description:\"Which YAML key to use for modification date\"": "description:\"用于 YAML 修改日期键\"",
        "description:\"Adds a header with the title from heading.\"": "description:\"添加以标题行为内容的标题。\"",
        "description:\"Adds a header with the title from heading without YAML key when the use of the YAML key is set to false.\"": "description:\"当 YAML 键的使用设置为 false 时，添加一个标题行而不是 YAML 键。\"",
        "description:\"Adds a header with the title.\"": "description:\"添加以标题为内容的标题行。\"",
        "description:\"Adds a header with the title without YAML key when the use of the YAML key is set to false.\"": "description:\"当 YAML 键的使用设置为 false 时，添加带有标题而不带 YAML 键的标题行。\"",
        "description:\"Replaces old filename with new filename when no header is present and filename is different than the old one listed in `linter-yaml-title-alias`.\"": "description:\"当不存在标题，并且文件名不同于 `linter-yaml-title-alias` 中列出的旧文件名时，用新文件名替换旧文件名。\"",
        "description:\"Make sure that markdown and wiki links in first H1 get their values converted to text\"": "description:\"确保将第一个 H1标题行中的 MD 语法或 wiki 链接转换为文本\"",
        "description:\"If set, the `YAML aliases section style` setting applies only to the newly created sections\"": "description:\"设置后 `YAML别名部分样式` 设置仅适用于新创建的部分\"",
        "description:\"Such aliases are usually redundant\"": "description:\"这样的别名通常是多余的\"",
        "description:\"If set, when the first H1 heading changes or filename if first H1 is not present changes, then the old alias stored in this key will be replaced with the new value instead of just inserting a new entry in the aliases array\"": "description:\"设置后，当第一个H1标题行或文件名（若H1标题行不存在）发生改变时，存储在该键中的旧别名将被新值替换，而不是在别名数组中插入新条目\"",
        "description:\"Make sure that markdown links in headings are properly copied to the yaml as just the text\"": "description:\"确保标题中的 MD 链接像普通文本一样正确复制到 Yaml 中\"",
        "description:\"Which YAML key to use for title\"": "description:\"标题所使用的 YAML 键名\"",
        "return\"Auto-correct Common Misspellings\"": "return\"自动更正拼写错误\"",
        "return\"Uses a dictionary of common misspellings to automatically convert them to their proper spellings. See [auto-correct map](https://github.com/platers/obsidian-linter/tree/master/src/utils/auto-correct-misspellings.ts) for the full list of auto-corrected words.\"": "return\"使用常见拼写错误词典将它们自动转换为正确的拼写。查看 [自动更正说明](https://github.com/platers/obsidian-linter/tree/master/src/utils/auto-correct-misspellings.ts) 的完整文档列表。\"",
        "name:\"Ignore Words\"": "name:\"忽略单词\"",
        "return\"Add Blockquote Indentation on Paste\"": "return\"粘贴时添加块引用缩进\"",
        "return\"Adds blockquotes to all but the first line, when the cursor is in a blockquote/callout line during pasting\"": "return\"在粘贴过程中，当光标位于块引用/标注行中时，将块引用添加到除第一行之外的所有行\"",
        "return\"Capitalize Headings\"": "return\"大写标题\"",
        "return\"Headings should be formatted with capitalization\"": "return\"标题应采用大写格式\"",
        "name:\"Ignore Cased Words\"": "name:\"忽略大小写单词\"",
        "name:\"Lowercase Words\"": "name:\"小写单词\"",
        "return\"Compact YAML\"": "return\"紧凑型 YAML\"",
        "return\"Removes leading and trailing blank lines in the YAML front matter.\"": "return\"删除 YAML 里的前导和尾随空行。\"",
        "name:\"Inner New Lines\"": "name:\"删除新行\"",
        "return\"Consecutive blank lines\"": "return\"连续空行\"",
        "return\"There should be at most one consecutive blank line.\"": "return\"最多保留一个连续的空行。\"",
        "return\"Convert Bullet List Markers\"": "return\"转换项目符号, 列表标记\"",
        "return\"Converts common bullet list marker symbols to markdown list markers.\"": "return\"将常用项目符号列表的标记符号转换为 MarkDown 列表标记。\"",
        "return\"Convert Spaces to Tabs\"": "return\"空格转为制表符\"",
        "return\"Converts leading spaces to tabs.\"": "return\"将每行的前导空格转换为制表符。\"",
        "return\"Emphasis Style\"": "return\"强调样式\"",
        "return\"Makes sure the emphasis style is consistent.\"": "return\"确保强调样式一致。\"",
        "return\"Empty Line Around Blockquotes\"": "return\"块引用周围的空行\"",
        "return\"Ensures that there is an empty line around blockquotes unless they start or end a document. **Note that an empty line is either one less level of nesting for blockquotes or a newline character.**\"": "return\"确保在块引用周围有一个空行，除非它位于文档的开始或结尾。**注意**，空行要么是少了一层嵌套的块引号，要么是换行符\"",
        "return\"Empty Line Around Code Fences\"": "return\"代码块周围的空行\"",
        "return\"Ensures that there is an empty line around code fences unless they start or end a document.\"": "return\"确保代码块周围有一个空行，除非它们位于文档开始或结束位置。\"",
        "return\"Empty Line Around Math Blocks\"": "return\"数学块周围的空行\"",
        "return\"Ensures that there is an empty line around math blocks using `Number of Dollar Signs to Indicate a Math Block` to determine how many dollar signs indicates a math block for single-line math.\"": "return\"确保在数学块周围有一个空行，使用【用于指示数学块的美元符号的数量】来确定有多少美元符号表示用于单行数学的数学块。\"",
        "return\"Empty Line Around Tables\"": "return\"表格周围的空行\"",
        "return\"Ensures that there is an empty line around github flavored tables unless they start or end a document.\"": "return\"确保表格周围有一个空行，除非表格位于文档的开始或结尾。\"",
        "return\"Escape YAML Special Characters\"": "return\"转义特殊字符\"",
        "return`Escapes colons with a space after them (: ), single quotes ('), and double quotes (\") in YAML.`": "return`在 YAML 中转义后带空格的冒号, 单引号和双引号。`",
        "name:\"Try to Escape Single Line Arrays\"": "name:\"尝试转义单行数组\"",
        "return\"File Name Heading\"": "return\"文件名标题\"",
        "return\"Inserts the file name as a H1 heading if no H1 heading exists.\"": "return\"如果不存在 H1 标题，则将文件名作为 H1 标题插入。\"",
        "Name:\"File Name\"": "Name:\"文件名\"",
        "return\"Footnote after Punctuation\"": "return\"标点后的脚注\"",
        "return\"Ensures that footnote references are placed after punctuation, not before.\"": "return\"确保脚注引用放在标点符号之后(不是之前)。\"",
        "return\"Force YAML Escape\"": "return\"强制转义\"",
        "return\"Escapes the values for the specified YAML keys.\"": "return\"转义指定 YAML 键的值。\"",
        "name:\"Force YAML Escape on Keys\"": "name:\"在 YAML 键上强制转义\"",
        "return\"Format Tags in YAML\"": "return\"格式化标签内容\"",
        "return\"Remove Hashtags from tags in the YAML frontmatter, as they make the tags there invalid.\"": "return\"从 YAML 中整理标签样式，此操作会使原有标签格式失效。\"",
        "return\"Format Yaml Array\"": "return\"格式化数组内容\"",
        "return\"Allows for the formatting of regular yaml arrays as either multi-line or single-line and `tags` and `aliases` are allowed to have some Obsidian specific yaml formats. Note that single string to single-line goes from a single string entry to a single-line array if more than 1 entry is present. The same is true for single string to multi-line except it becomes a multi-line array.\"": "return\"允许将 YAML 中常规的数组格式化为多行或单行样式，并允许标签和别名具有一些特定格式。请注意，如果存在多个条目，则【单字符串到单\\多行】将从单行字符串条目变为单, 多行数组。\"",
        "name:\"Format yaml aliases section\"": "name:\"设置 YAML 别名部分的格式\"",
        "name:\"Format yaml tags section\"": "name:\"设置 YAML 标签部分的格式\"",
        "name:\"Default yaml array section style\"": "name:\"默认 YAML 数组部分的样式\"",
        "name:\"Format yaml array sections\"": "name:\"格式化数组部分\"",
        "name:\"Force key values to be single-line arrays\"": "name:\"强制键值为单行数组\"",
        "name:\"Force key values to be multi-line arrays\"": "name:\"强制键值为多行数组\"",
        "return\"Header Increment\"": "return\"级别增量\"",
        "return\"Heading levels should only increment by one level at a time\"": "return\"标题级别一次只能增加一个级别\"",
        "name:\"Start Header Increment at Heading Level 2\"": "name:\"从 标题2 级别开始增量\"",
        "return\"Heading blank lines\"": "return\"标题周围的空行\"",
        "return\"All headings have a blank line both before and after (except where the heading is at the beginning or end of the document).\"": "return\"所有标题的前后都保留一个空行(位于文档开头或结尾的标题除外)。\"",
        "name:\"Empty Line Between Yaml and Header\"": "name:\"Yaml 和标题之间的空行\"",
        "return\"Headings Start Line\"": "return\"标题起始行\"",
        "return\"Headings that do not start a line will have their preceding whitespace removed to make sure they get recognized as headers.\"": "return\"不以行开头的标题将删除其前面的空格，以确保它们被识别为标题。\"",
        "return\"Insert YAML attributes\"": "return\"插入 YAML 属性\"",
        "return\"Inserts the given YAML attributes into the YAML frontmatter. Put each attribute on a single line.\"": "return\"将给定的 YAML 属性插入到 YAML 中。每个属性各占一行。\"",
        "name:\"Text to insert\"": "name:\"要插入的文本\"",
        "return\"Line Break at Document End\"": "return\"文档末尾换行符\"",
        "return\"Ensures that there is exactly one line break at the end of a document.\"": "return\"确保文档末尾只有一个换行符。\"",
        "return\"Move Footnotes to the bottom\"": "return\"脚注移到底部\"",
        "return\"Move all footnotes to the bottom of the document.\"": "return\"将所有脚注移到文档底部。\"",
        "return\"Move Math Block Indicators to Their Own Line\"": "return\"指示器移到数学块行\"",
        "return\"Move all starting and ending math block indicators to their own lines using `Number of Dollar Signs to Indicate a Math Block` to determine how many dollar signs indicates a math block for single-line math.\"": "return\"使用【用于指示数学块的美元符号数量】将所有数学块的开始和结束指示器移动到各自的行中，以确定有多少美元符号表示用于单行数学的数学块。\"",
        "return\"Move Tags to Yaml\"": "return\"将标签移动到 Yaml\"",
        "return\"Move all tags to Yaml frontmatter of the document.\"": "return\"将所有标签移动到文档的  Yaml 内。\"",
        "name:\"Body tag operation\"": "name:\"正文标签操作\"",
        "name:\"Tags to ignore\"": "name:\"要忽略的标签\"",
        "return\"No Bare URLs\"": "return\"格式化网址\"",
        "return\"Encloses bare URLs with angle brackets except when enclosed in back ticks, square braces, or single or double quotes.\"": "return\"用尖括号将裸露的网址 URL 括起来，除非已经被反引号, 方括号, 单引号或双引号括起来。\"",
        "return\"Ordered List Style\"": "return\"有序列表样式\"",
        "return\"Makes sure that ordered lists follow the style specified. Note that 2 spaces or 1 tab is considered to be an indentation level.\"": "return\"确保有序列表遵循指定的样式。注意，两个空格或一个制表符被认为是缩进级别。\"",
        "name:\"Number Style\"": "name:\"数字样式\"",
        "name:\"Ordered List Indicator End Style\"": "name:\"有序列表的结束样式\"",
        "return\"Paragraph blank lines\"": "return\"段落周围的空行\"",
        "return\"All paragraphs should have exactly one blank line both before and after.\"": "return\"所有段落前后都只保留一个空行。\"",
        "return\"Prevent Double Checklist Indicator on Paste\"": "return\"防止粘贴时出现双重列表指示符\"",
        "return\"Removes starting checklist indicator from the text to paste if the line the cursor is on in the file has a checklist indicator\"": "return\"如果文件中光标所在行具有任务清单指示符，则从要粘贴的文本中删除任务清单指示符\"",
        "return\"Prevent Double List Item Indicator on Paste\"": "return\"防止粘贴时出现重复的列表项指示符\"",
        "return\"Removes starting list indicator from the text to paste if the line the cursor is on in the file has a list indicator\"": "return\"如果文件中光标所在行具有列表指示符，则从要粘贴的文本中删除列表指示符\"",
        "return\"Proper Ellipsis on Paste\"": "return\"粘贴时正确显示省略号\"",
        "return\"Replaces three consecutive dots with an ellipsis even if they have a space between them in the text to paste\"": "return\"用三个连续的点替换省略号，即使它们之间存在空格\"",
        "return\"Proper Ellipsis\"": "return\"适当的省略\"",
        "return\"Replaces three consecutive dots with an ellipsis.\"": "return\"用省略号替换三个连续的点。\"",
        "return\"Re-Index Footnotes\"": "return\"重新索引脚注\"",
        "return\"Re-indexes footnote keys and footnote, based on the order of occurrence (NOTE: This rule deliberately does *not* preserve the relation between key and footnote, to be able to re-index duplicate keys.)\"": "return\"根据出现顺序重新索引脚注键和脚注 (注意: 该规则故意*不*保留键和脚注之间的关系，以便能够重新索引重复的键。)\"",
        "return\"Remove Consecutive List Markers\"": "return\"删除连续的列表标记\"",
        "return\"Removes consecutive list markers. Useful when copy-pasting list items.\"": "return\"删除连续的列表标记。在复制粘贴列表项时很有用。\"",
        "return\"Remove Empty Lines Between List Markers and Checklists\"": "return\"删除标记和列表之间的空行\"",
        "return\"There should not be any empty lines between list markers and checklists.\"": "return\"检查列表标记和列表之间不应该有任何空行。\"",
        "return\"Remove Empty List Markers\"": "return\"删除空列表的标记\"",
        "return\"Removes empty list markers, i.e. list items without content.\"": "return\"删除空列表(没有内容的列表项)的标记。\"",
        "return\"Remove Hyphenated Line Breaks\"": "return\"删除带连字符的换行符\"",
        "return\"Removes hyphenated line breaks. Useful when pasting text from textbooks.\"": "return\"删除带连字符的换行符。粘贴课本中的文本时很有用。\"",
        "return\"Remove Hyphens on Paste\"": "return\"删除所贴文本中的连字符\"",
        "return\"Removes hyphens from the text to paste\"": "return\"从所贴文本中删除连字符\"",
        "return\"Remove Leading or Trailing Whitespace on Paste\"": "return\"删除所贴文本中的前导或尾随空格\"",
        "return\"Removes any leading non-tab whitespace and all trailing whitespace for the text to paste\"": "return\"删除所贴文本中的所有前导空格(非制表符)和尾随空格\"",
        "return\"Remove Leftover Footnotes from Quote on Paste\"": "return\"粘贴时从引用中删除剩余脚注\"",
        "return\"Removes any leftover footnote references for the text to paste\"": "return\"删除要所贴文本中的所有剩余脚注引用\"",
        "return\"Remove link spacing\"": "return\"删除链接周围的空格\"",
        "return\"Removes spacing around link text.\"": "return\"删除链接文本周围的空格。\"",
        "return\"Remove Multiple Blank Lines on Paste\"": "return\"删除粘贴时的多个空行\"",
        "return\"Condenses multiple blank lines down into one blank line for the text to paste\"": "return\"将多个空行压缩为一个空行，以便粘贴文本\"",
        "return\"Remove Multiple Spaces\"": "return\"删除多个空格\"",
        "return\"Removes two or more consecutive spaces. Ignores spaces at the beginning and ending of the line. \"": "return\"删除连续的两个或多个空格。忽略行首和行尾的空格。\"",
        "return\"Remove Space around Characters\"": "return\"删除字符周围的空格\"",
        "return\"Ensures that certain characters are not surrounded by whitespace (either single spaces or a tab). Note that this may causes issues with markdown format in some cases.\"": "return\"确保某些字符不会被空格(单个空格或制表符)包围。注意，在某些情况下可能会导致 MD 语法出现问题。\"",
        "name:\"Include Fullwidth Forms\"": "name:\"包括全角表单\"",
        "name:\"Include CJK Symbols and Punctuation\"": "name:\"包括 CJK 符号和标点符号\"",
        "name:\"Include Dashes\"": "name:\"包括破折号\"",
        "name:\"Other symbols\"": "name:\"其他符号\"",
        "return\"Remove Trailing Punctuation in Heading\"": "return\"删除尾随标点\"",
        "return\"Removes the specified punctuation from the end of headings making sure to ignore the semicolon at the end of [HTML entity references](https://en.wikipedia.org/wiki/List_of_XML_and_HTML_character_entity_references).\"": "return\"从标题末尾删除指定的标点符号，确保忽略末尾的分号或遵循[HTML 实体引用](https://en.wikipedia.org/wiki/List_of_XML_and_HTML_character_entity_references).\"",
        "name:\"Trailing Punctuation\"": "name:\"末尾的标点符号\"",
        "return\"Remove YAML Keys\"": "return\"删除 YAML 键\"",
        "return\"Removes the YAML keys specified\"": "return\"删除指定的 YAML 键\"",
        "name:\"YAML Keys to Remove\"": "name:\"要删除的 YAML 键\"",
        "return\"Space after list markers\"": "return\"列表标记后的空格\"",
        "return\"There should be a single space after list markers and checkboxes.\"": "return\"列表标记和复选框后面应该有一个空格。\"",
        "return\"Space between Chinese Japanese or Korean and English or numbers\"": "return\"中文, 日语, 韩语, 英语或数字之间的空格\"",
        "return\"Ensures that Chinese, Japanese, or Korean and English or numbers are separated by a single space. Follows these [guidelines](https://github.com/sparanoid/chinese-copywriting-guidelines)\"": "return\"确保中文, 日文, 韩文和英文或数字之间用空格隔开。请遵循以下 [指导方针](https://github.com/sparanoid/chinese-copywriting-guidelines)\"",
        "description:'Include <a href=\"https://en.wikipedia.org/wiki/Halfwidth_and_Fullwidth_Forms_(Unicode_block)\">Fullwidth Forms Unicode block</a>'": "description:'包括 <a href=\"https://en.wikipedia.org/wiki/Halfwidth_and_Fullwidth_Forms_(Unicode_block)\">全角形式 Unicode 块</a>'",
        "description:'Include <a href=\"https://en.wikipedia.org/wiki/CJK_Symbols_and_Punctuation\">CJK Symbols and Punctuation Unicode block</a>'": "description:'包括 <a href=\"https://en.wikipedia.org/wiki/CJK_Symbols_and_Punctuation\">CJK 符号和标点符号 Unicode 块</a>'",
        "description:\"Include en dash (\\u2013) and em dash (\\u2014)\"": "description:\"包括破折号 (\\u2013) 和长破折号 (\\u2014)\"",
        "description:\"Other symbols to include\"": "description:\"包括的其他符号\"",
        "return\"Strong Style\"": "return\"强调的风格\"",
        "return\"Makes sure the strong style is consistent.\"": "return\"确保风格一致。\"",
        "return\"Trailing spaces\"": "return\"行尾的空格\"",
        "return\"Removes extra spaces after every line.\"": "return\"删除每行末尾的多余空格。\"",
        "name:\"Two Space Linebreak\"": "name:\"两个空格的换行符\"",
        "return\"Two Spaces Between Lines with Content\"": "return\"两行之间加两个空格\"",
        "return\"Makes sure that two spaces are added to the ends of lines with content continued on the next line for paragraphs, blockquotes, and list items\"": "return\"确保在行尾添加两个空格，并在下一行继续显示段落, 块引号和列表项等内容\"",
        "return\"Unordered List Style\"": "return\"无序列表样式\"",
        "return\"Makes sure that unordered lists follow the style specified.\"": "return\"确保无序列表遵循指定的样式。\"",
        "name:\"List item style\"": "name:\"列表项目样式\"",
        "return\"YAML Key Sort\"": "return\"YAML 键排序\"",
        "return\"Sorts the YAML keys based on the order and priority specified. Note: may remove blank lines as well.\"": "return\"根据指定的顺序和优先级对 YAML 键进行排序。注意:也可以删除空行。\"",
        "name:\"YAML Key Priority Sort Order\"": "name:\"YAML 键值优先级排列顺序\"",
        "name:\"Priority Keys at Start of YAML\"": "name:\"YAML 开始时的优先级键\"",
        "name:\"YAML Sort Order for Other Keys\"": "name:\"YAML 其他键的排列顺序\"",
        "return\"YAML Timestamp\"": "return\"YAML 时间戳\"",
        "return\"Keep track of the date the file was last edited in the YAML front matter. Gets dates from file metadata.\"": "return\"跟踪文件（从元数据中获取）创建及编辑的日期并显示到 YAML 中。\"",
        "name:\"Date Created\"": "name:\"创建日期\"",
        "name:\"Date Created Key\"": "name:\"创建日期的键名\"",
        "name:\"Date Modified\"": "name:\"修改日期\"",
        "name:\"Date Modified Key\"": "name:\"修改日期的键名\"",
        "name:\"Format\"": "name:\"格式化\"",
        "description:\"Moment date format to use (see [Moment format options](https://momentjscom.readthedocs.io/en/latest/moment/04-displaying/01-format/))\"": "description:\"使用的日期格式 （查看 [格式选项](https://momentjscom.readthedocs.io/en/latest/moment/04-displaying/01-format/)）\"",
        "return\"YAML Title Alias\"": "return\"YAML 标题别名\"",
        "return\"Inserts the title of the file into the YAML frontmatter's aliases section. Gets the title from the first H1 or filename.\"": "return\"将标题名称插入到 YAML 的别名部分。从首个 H1标题行或文件名获取此名称。\"",
        "name:\"Preserve existing aliases section style\"": "name:\"保留现有别名部分样式\"",
        "name:\"Keep alias that matches the filename\"": "name:\"保留与文件名匹配的别名\"",
        "name:\"Use the YAML key `linter-yaml-title-alias` to help with filename and heading changes\"": "name:\"使用 YAML 键名 `linter-yaml-title-alias` 来帮助更改文件名和标题\"",
        "return\"YAML Title\"": "return\"YAML 标题\"",
        "return\"Inserts the title of the file into the YAML frontmatter. Gets the title from the first H1 or filename if there is no H1.\"": "return\"将文件标题插入到 YAML 中。从第一个 H1标题行或文件名（如果没有 H1标题行）中获取标题。\"",
        "name:\"Title Key\"": "name:\"标题的键名\"",
        "t=\"the status is still the same\"": "t=\"状态仍然相同\"",
        "t=\"Lint on save\"": "t=\"保存 Lint 文件\"",
        "t=\"Display message on lint\"": "t=\"在 lint 中显示信息\"",
        "t=\"Folders to ignore\"": "t=\"要忽略的文件夹\"",
        "t=\"Override locale\"": "t=\"覆盖区域设置\"",
        "t=\"YAML aliases section style\"": "t=\"YAML 别名部分样式\"",
        "t=\"YAML tags section style\"": "t=\"YAML 标签部分样式\"",
        "t=\"Default Escape Character\"": "t=\"默认转义符\"",
        "t=\"Number of Dollar Signs to Indicate Math Block\"": "t=\"表示数学块的美元符号数\"",
        "setPlaceholder(\"Obsidian command\"": "setPlaceholder(\"Obsidian 命令\"",
        "setPlaceholder(\"regex to find\"": "setPlaceholder(\"正则查找\"",
        "setPlaceholder(\"regex to replace\"": "setPlaceholder(\"正则替换\"",
        "setPlaceholder(\"Search all settings\"": "setPlaceholder(\"搜索所有设置项\"",
        "t=\"Log Level\"": "t=\"日志级别\"",
        "t=\"Linter Config\"": "t=\"Linter 配置\"",
        "t=\"Collect logs when linting on save and linting the current file\"": "t=\"在保存时删除和删除当前文件时收集日志\"",
        "t=\"Linter Logs\"": "t=\"Linter 日志\"",
        "ruleConfigs[\"Move Tags to Yaml\"": "ruleConfigs[\"将标签移动到 Yaml\"",
        "ruleConfigs[\"Force YAML Escape\"": "ruleConfigs[\"强制转义\"",
        "ruleConfigs[\"Escape YAML Special Characters\"": "ruleConfigs[\"转义特殊字符\"",
        "ruleConfigs[\"Space between Chinese and English or numbers\"": "ruleConfigs[\"中英文或数字之间的空格\"",
        "ruleConfigs[\"Space between Chinese Japanese or Korean and English or numbers\"": "ruleConfigs[\"中文, 日语, 韩语, 英语或数字之间的空格\"",
        "name:\"Lint the current file\"": "name:\"处理当前文件\"",
        "name:\"Lint the current file unless ignored\"": "name:\"处理当前文件（除非被忽略）\"",
        "name:\"Lint all files in the vault\"": "name:\"处理库中所有文件\"",
        "t=\"This will edit all of your files and may introduce errors.\"": "t=\"这将编辑您的所有文件，并可能导致错误。\"",
        "name:\"Lint all files in the current folder\"": "name:\"Lint 当前文件夹中的所有文件\"",
        "name:\"Paste as Plain Text & without Modifications\"": "name:\"粘贴为纯文本（不加修改）\"",
        "name:\"Tabsize\"": "name:\"制表符大小\"",
        "Title(\"Lint file\"": "Title(\"Lint 文件\"",
        "Title(\"Lint folder\"": "Title(\"Lint 文件夹\"",
        "n=\"This will edit all of your files in \"": "n=\"这将编辑您所有的文件\"",
        "ruleConfigs[\"YAML Title Alias\"": "ruleConfigs[\"YAML 标题别名\"",
        "t=\"single string to multi-line\"": "t=\"单字符串到多行\"",
        "t=\"single string to single-line\"": "t=\"单字符串到单行\"",
        "ruleConfigs[\"Format Yaml Array\"": "ruleConfigs[\"设置 Yaml 数组格式\"",
        "t=\"single string comma delimited\"": "t=\"单字符串用逗号分隔\"",
        "n=\"Lint the file on manual save (when `Ctrl + S` is pressed or when `:w` is executed while using vim keybindings)\"": "n=\"手动保存 Lint 文件(当按下 `Ctrl+S` 或使用 vim 键绑定时执行 `:w` 时)\"",
        "n=\"Display the number of characters changed after linting\"": "n=\"显示 Linting 后更改的字符数\"",
        "n=\"Folders to ignore when linting all files or linting on save. Enter folder paths separated by newlines\"": "n=\"删除所有文件或保存时删除时要忽略的文件夹。输入用换行符分隔的文件夹路径\"",
        "n=\"Set this if you want to use a locale different from the default\"": "n=\"如果要使用不同于默认设置的区域设置，请设置此项\"",
        "n=\"The style of the YAML aliases section\"": "n=\"YAML 别名部分的样式\"",
        "n=\"The style of the YAML tags section\"": "n=\"YAML 标记部分的样式\"",
        "n=\"The default character to use to escape YAML values when a single quote and double quote are not present.\"": "n=\"当不存在单引号和双引号时，用于转义YAML值的默认字符。\"",
        "n=\"The amount of dollar signs to consider the math content to be a math block instead of inline math\"": "n=\"将数学内容视为数学块而非内联数学的美元符号数量\"",
        "n=\"The types of logs that will be allowed to be logged by the service. The default is ERROR.\"": "n=\"服务允许记录的日志类型。默认值为 ERROR。\"",
        "n=\"The contents of the data.json for the Linter as of the setting page loading\"": "n=\"加载设置页面时 Linter 的 data.json 的内容\"",
        "n=\"Goes ahead and collects logs when you `Lint on save` and linting the current file. These logs can be helpful for debugging and create bug reports.\"": "n=\"当您`保存时跳过`并跳过当前文件时，继续并收集日志。这些日志有助于调试和创建错误报告。\"",
        "n=\"The logs from the last `Lint on save` or the last lint current file run if enabled.\"": "n=\"如果已启用，则运行最后一个`Lint 保存时`或最后一个 Lint 当前文件中的日志。\"",
        "n=\"Lint All\"": "n=\"全部 Lint\"",
        "name:\"Style\"": "name:\"样式\"",
        "name:\"Bottom\"": "name:\"后面的空行\"",
        "${t} characters added": "添加了 ${t} 个字符",
        "${n} characters removed": "移除了 ${n} 个字符",
        "text:n+\" Settings\"": "text:n+\" 设置\"",
        "\"Custom Commands\",\"Custom commands are Obsidian commands that get run after the linter is finished running its regular rules. This means that they do not run before the YAML timestamp logic runs, so they can cause YAML timestamp to be triggered on the next run of the linter. You may only select an Obsidian command once. **_Note that this currently only works on linting the current file._**\",\"When selecting an option, make sure to select the option either by using the mouse or by hitting the enter key. Other selection methods may not work and only selections of an actual Obsidian command or an empty string will be saved.\",\"Add new command\"": "\"自定义命令\",\"自定义命令是在 linter 运行完它的常规规则后运行的 黑曜石命令。这意味着它们不会在 YAML 时间戳逻辑运行之前执行，因此它们会导致在 linter 的下一次运行时触发 YAML 时间戳。你只能选择一次黑曜石命令。 **_请注意，这目前仅适用于 lint 当前文件._**\",\"当选择一个选项时，确保使用鼠标或回车键来选择该项。其他选择方法不起作用，只有选择一个黑曜石命令或空字符串将被保存。\",\"添加新命令\"",
        "\"Custom Regex Replacement\",\"Custom regex replacement can be used to replace anything that matches the find regex with the replacement value. The replace and find values will need to be valid regex values.\",\"Use this with caution if you do not know regex. Also, please make sure that you do not use lookbehinds in your regex on iOS mobile as that will cause linting to fail since that is not supported on that platform.\",\"Add new regex replacement\"": "\"自定义正则表达式替换\",\"自定义正则表达式替换 可用于替换任何与查找表达式相匹配的内容。替换和查找均需要使用有效的正则表达式.\",\"如果您不了解正则表达式，请谨慎使用。此外，请确保您不要在 iOS mobile 的正则表达式中使用 lookbehinds，因为该平台不支持，会导致 lint 失败。\",\"添加表达式\""
    }
}
