{
  "manifest": {
    "translationVersion": -639075600000,
    "pluginVersion": "0.13.6"
  },
  "description": {
    "original": "Simple timeline generator for story tellers",
    "translation": "Simple timeline generator for story tellers"
  },
  "dict": {
    "metadataKeyEventStartDate:\"Event start key\"": "metadataKeyEventStartDate:\"事件开始key\"",
    "metadataKeyEventStartDate:\"The key that determines the start of an event in a note\"": "metadataKeyEventStartDate:\"确定笔记中事件开始的key\"",
    "metadataKeyEventEndDate:\"The key that determines the end of an event in a note\"": "metadataKeyEventEndDate:\"确定笔记中事件结束的key\"",
    "metadataKeyEventEndDate:\"Event end key\"": "metadataKeyEventEndDate:\"事件结束key\"",
    "metadataKeyEventTitleOverride:\"Event title override\"": "metadataKeyEventTitleOverride:\"事件标题覆盖\"",
    "metadataKeyEventTitleOverride:\"The key for the title override in each notes metadata\"": "metadataKeyEventTitleOverride:\"每个笔记元数据中标题覆盖的key\"",
    "metadataKeyEventBodyOverride:\"Event body override\"": "metadataKeyEventBodyOverride:\"事件正文覆盖\"",
    "metadataKeyEventBodyOverride:\"The key for the body override in each notes metadata\"": "metadataKeyEventBodyOverride:\"每个笔记元数据中覆盖正文的的key\"",
    "metadataKeyEventPictureOverride:\"The key for the image override in each notes metadata\"": "metadataKeyEventPictureOverride:\"每个笔记元数据中图像覆盖的key\"",
    "metadataKeyEventPictureOverride:\"Event image override\"": "metadataKeyEventPictureOverride:\"事件图片覆盖\"",
    "metadataKeyEventTimelineTag:\"Event timelines tags\"": "metadataKeyEventTimelineTag:\"事件时间线tags\"",
    "metadataKeyEventTimelineTag:\"The key looked for when assigning timelines to an event\"": "metadataKeyEventTimelineTag:\"为事件分配时间线时查找的key\"",
    "markdownBlockTagsToFindSeparator:'Markdown Code Block \"Tags To Find\" Separator'": "markdownBlockTagsToFindSeparator:\"Markdown 代码块中用于分隔tags使得能被查找到的分隔符\"",
    "markdownBlockTagsToFindSeparator:\"The character or string used to split the different tags to find in a markdown code block. The split values will be looked for in notes.\"": "markdownBlockTagsToFindSeparator:\"用于拆分不同标签以在 Markdown 代码块中查找的字符或字符串。将在笔记中查找拆分值。\"",
    "oteInlineEventKey:\"The note inline event key\"": "oteInlineEventKey:\"笔记内联事件key\"",
    "noteInlineEventKey:'Used to detect inline events. This is the key written after the \"%%\" signs to open an inline event block.'": "noteInlineEventKey:'用于检测内联事件。这是写在 “%%” 符号后面的键，用于打开内联事件块。'",
    "inlineEventEndOfBodyMarker:\"End of event body token\"": "inlineEventEndOfBodyMarker:\"事件正文结束指示\"",
    "inlineEventEndOfBodyMarker:\"Used to mark the line where the body parsing will stop\"": "inlineEventEndOfBodyMarker:\"用于标记正文解析将停止的行\"",
    "eventRenderToggleKey:\"Render toggle key\"": "eventRenderToggleKey:\"渲染切换键\"",
    "eventRenderToggleKey:\"The key used to control if a perculiar event is rendered or not\"": "eventRenderToggleKey:\"用于控制是否渲染 perculiar 事件的key\"",
    "lookForInlineEventsInNotes:\"Look for events in note body\"": "lookForInlineEventsInNotes:\"在注释正文中查找事件\"",
    "lookForInlineEventsInNotes:\"Check to ennable the inline event feature. This allows to define events for any timeline from inside a note.\"": "lookForInlineEventsInNotes:\"选中以启用内联事件功能。这允许从笔记中为任何时间线定义事件。\"",
    "lookForInlineEventsInNotes:\"Check {linkText} on how to create inline events.\"": "lookForInlineEventsInNotes:\"点击 {linkText} 了解如何创建内联事件。.\"",
    "lookForTagsForTimeline:\"Look into note tags\"": "lookForTagsForTimeline:\"查看笔记标签\"",
    "lookForTagsForTimeline:\"Check to include a notes tags into the values used to assign notes to a timeline\"": "lookForTagsForTimeline:\"选中以将笔记标签包含在用于将笔记分配给时间轴的值中\"",
    "lookForTagsForTimeline:\"This means if you tag you note with a string and include that string in the timeline definition this note will be included in the timeline computing\"": "lookForTagsForTimeline:\"这意味着，如果使用字符串标记注释并将该字符串包含在时间线定义中，则此注释将包含在时间线计算中\"",
    "applyAdditonalConditionFormatting:\"Apply additonal condition based formatting\"": "applyAdditonalConditionFormatting:\"应用基于附加条件的格式\"",
    "applyAdditonalConditionFormatting:\"Toggle on to allow date tokens conditional formatting to be allowed. When set to false this feature will be skipped. This could save you a few milliseconds off every card render.\"": "applyAdditonalConditionFormatting:\"打开以允许日期标记条件格式。当设置为 false 时，将跳过此功能。这可以为您节省每次卡片渲染的几毫秒时间。\"",
    "stylizeDateInline:\"Inline date style\"": "stylizeDateInline:\"内联日期样式\"",
    "stylizeDateInline:\"Turn on to align the date with the title in the timeline cards.\"": "stylizeDateInline:\"启用此选项可将日期与时间轴卡中的标题对齐。\"",
    "stylizeDateInline:\"Turn on for a more compact display in your timeline event cards. Or turn off for more space.\"": "stylizeDateInline:\"启用此选项可在时间轴事件卡中更紧凑地显示。或者关闭以获得更多空间。\"",
    "\"Enable presets for {slot}\"": "\"启用预设 {slot}\"",
    "fantasyCalendarPresetKeys:\"Use fantady calendar keys\"": "fantasyCalendarPresetKeys:\"使用幻想日历键\"",
    "fantasyCalendarPresetKeys:\"This will preset all relevant keys in the settings to watch fantasy calendar uses. Namely the title override, the start date and end date keys\"": "fantasyCalendarPresetKeys:\"这将在设置中预设所有相关键以观看幻想日历的使用。即标题覆盖、开始日期和结束日期键\"",
    "fantasyCalendarSpanEvents:{text:\"Look for {link}\"": "fantasyCalendarSpanEvents:{text:\"查看 {link}\"",
    "fantasyCalendarSpanEvents:\"Allow the plugin to look for span events inside the notes, this have a performance impact but furthers the compatibility with fantasy calendar\"": "fantasyCalendarSpanEvents:\"允许插件在笔记中查找跨度事件，这会影响性能，但会进一步增强与幻想日历的兼容性\"",
    "accessibility:\"Accessibility settings\"": "accessibility:\"辅助功能设置\"",
    "dateFontSize:\"Override the font size of the date in the timeline cards (value in pixels)\"": "dateFontSize:\"覆盖时间轴卡中日期的字体大小（以像素为单位的值）\"",
    "titleFontSize:\"Override the font size of the title in the timeline cards (value in pixels)\"": "titleFontSize:\"覆盖时间轴卡中标题的字体大小（以像素为单位的值）\"",
    "bodyFontSize:\"Override the font size of the body in the timeline cards (value in pixels)\"": "bodyFontSize:\"覆盖时间轴卡中正文的字体大小（以像素为单位的值）\"",
    "nav:{title:{index:\"Generic settings\",\"date-formats\":\"Date format settings\"": "nav:{title:{index:\"通用设置\",\"date-formats\":\"日期格式设置\"",
    "{wizzard:\"Setup wizzard\",presets:\"Presets\",advanced:\"Advanced\"}": "{wizzard:\"设置向导\",presets:\"预设\",advanced:\"高级\"}",
    "dateFormatFlowOnboarding:\"For this plugin to work it needs to be fed a couple of informations regarding dates and how to sort them.Right now token priority is as follow {dateParserGroupPriority} and output is formated using {dateDisplayFormat}. To customize this you can either use the more user friendly flow by pressing start or just edit the values yourself by hand. Worst case scenario you can also reset to default in the advanced section.\"": "dateFormatFlowOnboarding:\"要使此插件正常工作，需要提供一些有关日期以及如何对日期进行排序的信息。现在，令牌优先级如下{dateParserGroupPriority}输出使用{dateDisplayFormat}进行格式化。要自定义此值，您可以通过按 start 使用更用户友好的流程，或者自己手动编辑值。最坏的情况，您也可以在 高级 部分重置为默认值。\"",
    "datePreset:{title:{normal:\"Normal (The default)\",imperial:\"Imperial\",\"verbose-day\":\"Verbose day\",\"dnd-calendar-of-harptos-dalereckoning\":\"D&D - Calendar of harptos (dalereckoning)\"}": "datePreset:{title:{normal:\"正常 （默认）\",imperial:\"美式\",\"verbose-day\":\"详细日期\",\"dnd-calendar-of-harptos-dalereckoning\":\"D&D - 竖琴日历 (dalereckoning)\"}",
    "description:{normal:\"The most vanilla way to display a date.\"": "description:{normal:\"最普通的日期显示方式。\"",
    "imperial:\"The true american way of displaying a date.\"": "imperial:\"真正的美式日期显示方式。\"",
    "verbose-day\":\"For when you enjoy adding silly leters at the end of numbers. This format will append the st nd rd th particles after the days.\"": "verbose-day\":\"当你喜欢在数字末尾添加愚蠢的 leters 时。此格式将在日期后附加第 st nd 个小品词。\"",
    "\"dnd-calendar-of-harptos-dalereckoning\":`Good for D&D session notes - The Calendar of Harptos was the calendar used across most of Faer\\xFBn. It was created by the wizard Harptos of Kaalinth, although most people associate the word \"Harptos\" with the calendar. It was split into twelve months, each lasting three tendays (or thirty days). There were an additional five days that fell between months, bringing the total number of days in most years to 365. - Dalereckoning is taken from the Year of Sunrise, 1 DR, when the Standing Stone was raised by the elves of Cormanthyr and the humans of the Dalelands. Since this time, humans were permitted by the Elven Court to settle in the more open regions of the forests. In some texts, primarily those which do not have direct ties to Dalesfolk history, Dalereckoning is called Freeman's Reckoning (FR). The calendar is widely used in Faer\\xFBn but has not spread beyond its shores.`}": "\"dnd-calendar-of-harptos-dalereckoning\":`适合D&D会议记录 - Harptos的日历是FaerxFBn的大部分时间使用的日历。它是由卡林斯的巫师 Harptos 创造的，尽管大多数人将“Harptos”这个词与日历联系在一起。它被分成十二个月，每个月持续三个十天（或三十天）。月份之间还有 5 天，使大多数年份的总天数达到 365 天。- Dalereckoning 取自日出年，即 1 DR，当时立石由 Cormanthyr 的精灵和 Dalelands 的人类升起。从那时起，精灵宫廷允许人类在森林中更开阔的地区定居。在一些文本中，主要是那些与 Dalesfolk 历史没有直接联系的文本，Dalereckoning 被称为 Freeman's Reckoning （FR）。该日历在 FaerxFBn 中被广泛使用，但尚未传播到其境外。`}",
    "resetToDefault:\"Reset to default\"": "resetToDefault:\"重置为默认值\"",
    "dateParserRegex:\"Date parser regex\"": "dateParserRegex:\"日期解析器正则表达式\"",
    "dateParserRegex:\"The regex used to parse your date. It needs to include the same amount of capture group as the next setting input. If you're unfamilliar with regexes and / or capture groups I would recommend to stick to the preset.\"": "dateParserRegex:\"用于解析日期的正则表达式。它需要包含与下一个设置输入相同数量的捕获组。如果您对正则表达式和/或捕获组不熟悉，我建议您坚持使用预设。\"",
    "dateParserGroupPriority:\"Date parser group priority\"": "dateParserGroupPriority:\"日期解析器组优先级\"",
    "dateParserGroupPriority:'No spaces and make sure to separate every entry with a \",\". This value is used to order the parsed tokens. For example if your custom regex pulls the year month and day out of a date, the natural order should be \"year,month,day\". Note that you should have as many entries as your regex has capture groups. See presets for inspiration.'": "dateParserGroupPriority:'没有空格，并确保用 “，” 分隔每个条目。此值用于对解析的令牌进行排序。例如，如果您的自定义正则表达式从日期中提取年、月和日，则自然顺序应为“year，month，day”。请注意，您的条目数应与正则表达式的捕获组数相同。查看预设以获取灵感.'",
    "dateDisplayFormat:\"Date display format\"": "dateDisplayFormat:\"日期显示格式\"",
    "dateDisplayFormat:\"This is the end format the date should be displayed as in the actual timeline cards. You don't actually need to include every parsed member here.\"": "dateDisplayFormat:\"这是日期的结束格式，应与实际时间线卡中的显示格式相同。您实际上不需要在此处包含每个已解析的成员。\"",
    "advancedDateFormatsTokenConfiguration:\"Configure the tokens\"": "advancedDateFormatsTokenConfiguration:\"配置令牌\"",
    "configureSingleDateToken:{type:\"The type of the token\"": "configureSingleDateToken:{type:\"令牌的类型\"",
    "NUMBER:`A numerical typed date token is your stardard number representing a date. Just make sure to configure it's mininal lengh. For example a minimal length set to 2 will result in the 6th day being written as \"06\"`": "NUMBER:`数字键入的日期令牌是表示日期的标准数字。只需确保配置它的最小值。例如，最小长度设置为 2 将导致第 6 天写入 \"06\"`",
    "minLength:\"The minimum amount of digits\",hideSign:\"Hide the sign\"": "minLength:\"最小位数\",hideSign:\"隐藏标志\"",
    "minLength:\"If set to 2, this would always display at least two digit. So for a value of 3 it would display 03.\"": "minLength:\"如果设置为 2，则始终显示至少两位数。因此，对于值 3，它将显示 03。\"",
    "hideSign:\"When checked, the sign of the number won't be displayed on the card.\"": "hideSign:\"选中后，卡上不会显示数字的符号。\"",
    "conditionalFormatting:\"Add additional formatting\"}": "conditionalFormatting:\"添加其他格式\"}",
    "conditionsAreExclusive:\"Condtions are exclusive\"": "conditionsAreExclusive:\"条件是排他性的\"",
    "conditionsAreExclusive:\"When checked only one condition need to be true for the format to apply. If it's unchecked all conditions need to be true.\"": "conditionsAreExclusive:\"选中后，只需满足一个条件即可应用格式。如果未选中，则所有条件都需要为 true。\"",
    "format:\"The template format to apply\"": "format:\"要应用的模板格式\"",
    "format:\"Use `{value}` to include the formated token in the template.\"": "format:\"使用 `{value}` 在模板中包含格式化的令牌。\"",
    "addACondition:\"Add a condition to evaluate\"": "addACondition:\"添加要评估的条件\"",
    "createDateToken:\"Write your date system tokens ordered from top to bottom. Make sure not to leave any cluter, these token will be used to capture your date and sort them in the expeted order.\"": "createDateToken:\"按从上到下的顺序编写您的日期系统令牌。确保不要留下任何痕迹，这些令牌将用于捕获您的日期并按运行顺序对它们进行排序。\"",
    "tryoutDoesNotResolve:\"Optional: Tryout does not resolve, try typing the date as you would in the metadata of a note\"": "tryoutDoesNotResolve:\"可选：试用无法解析，请尝试像在注释的元数据中一样键入日期\"",
    "ignoreLineCommentToken:\"Use this token to remove lines of text in notes from the card\"": "ignoreLineCommentToken:\"使用此标记可从卡片中删除笔记中的文本行\"",
    "tryYourInputFormat:\"Try your input format out\"": "tryYourInputFormat:\"试用您的输入格式\"",
    "ignoreLineCommentToken:\"It should look something like this `Your line of text in a note %%aat-ignore-line%%`\"": "ignoreLineCommentToken:\"它应该看起来像这样 `笔记中的文本行 %%aat-ignore-line%%`\"",
    "tryYourInputFormat:\"Just type out the date like you would in a notes metadata block. Bellow, every field should corespond to the correct token and be sorted in the correct order.\"": "tryYourInputFormat:\"只需像在笔记元数据块中一样键入日期即可。在下面，每个字段都应该对应正确的标记，并按正确的顺序排序。\"",
    "tokenMismatch:\"You have mismatching tokens!\"": "tokenMismatch:\"您的令牌不匹配！\"",
    "tokenMismatchList:\"The previous list contains tokens that can't be found in your date token configuration, use the button bellow to update the token list and configure it properly once synced.\"": "tokenMismatchList:\"上一个列表包含在您的日期令牌配置中找不到的令牌，请使用下面的按钮更新令牌列表，并在同步后对其进行正确配置。\"",
    "syncTokens:\"Update tokens to reflect the above configuration\"": "syncTokens:\"更新令牌以反映上述配置\"",
    "stringTokenDctionaryEntry:\"Type the desired output of the token...\"": "stringTokenDctionaryEntry:\"键入令牌的所需输出...\""
  }
}