{
    "manifest": {
        "translationVersion": 1733382024170,
        "pluginVersion": "0.1.3"
    },
    "description": {
        "original": "Automatically saves the history of edits of a file when Obsidian saves the file, and allows viewing the differences between edits, copying text from a previous edit, or fully rolling back to a previous edit.",
        "translation": "Obsidian 保存文件时自动保存文件编辑历史记录，并允许查看编辑之间的差异、从上次编辑中复制文本或完全回滚到上次编辑。"
    },
    "dict": {
        ".error(e3)": ".error(e3)",
        ".error(e2)": ".error(e2)",
        ".error(this.generatedError)": ".error(this.generatedError)",
        "name: \"Open edit history for this file\"": "name: \"打开此文件的编辑历史记录\"",
        "name: \"Save current edit in the edit history\"": "name: \"将当前编辑保存在编辑历史中\"",
        "text: \"No edit history\"": "text: \"无编辑历史\"",
        "text: \"Created by \"": "text: \"Created by \"",
        "text: \"Antonio Tejada\"": "text: \"Antonio Tejada\"",
        "text: \"General\"": "text: \"General\"",
        "text: \"Appearance\"": "text: \"Appearance\"",
        "text: \"Debugging\"": "text: \"Debugging\"",
        ".setText(\"? edits\")": ".setText(\"? edits\")",
        ".setText(\"Edits for \")": ".setText(\"Edits for \")",
        ".setButtonText(\"Copy\")": ".setButtonText(\"复制\")",
        ".setName(\"Minimum seconds between edits\")": ".setName(\"编辑间隔最短秒数\")",
        ".setName(\"Maximum number of edits\")": ".setName(\"最大编辑次数\")",
        ".setName(\"Maximum age of edits\")": ".setName(\"编辑的最长期限\")",
        ".setName(\"Maximum size of the history file (KB)\")": ".setName(\"历史文件的最大大小（KB）\")",
        ".setName(\"File extension whitelist\")": ".setName(\"文件扩展名白名单\")",
        ".setName(\"Show on status bar\")": ".setName(\"显示在状态栏上\")",
        ".setName(\"Debug level\")": ".setName(\"调试级别\")",
        ".setDesc(\"Minimum number of seconds that must pass from the previous edit to store a new edit. Modifications done between those seconds will be merged into the next edit, reducing the edit history file size at the expense of less history granularity.\")": ".setDesc(\"从上一次编辑到存储新编辑必须经过的最小秒数。在这几秒之间所做的修改将合并到下一次编辑中，从而减少编辑历史文件的大小，但代价是历史粒度降低。\")",
        ".setDesc(\"Maximum number of edits to keep, set to 0 for no limit. Older edits will be deleted from the history in the next update, reducing the edit history file size at the expense of less history.\")": ".setDesc(\"保留的最大编辑数，设置为 0 表示无限制。较旧的编辑将在下次更新时从历史记录中删除，从而减少编辑历史记录文件的大小，但会减少历史记录。\")",
        ".setDesc(\"Oldest edit to keep in seconds, eg set to 3600 to delete edits that are more than one hour old, set to 0 for no limit. Older edits will be deleted from the history in the next update, reducing the edit history file size at the expense of less history.\")": ".setDesc(\"以秒为单位保留最早的编辑，例如，设置为 3600 表示删除超过一小时的编辑，设置为 0 表示无限制。较旧的编辑将在下次更新时从历史记录中删除，从而减少编辑历史记录文件的大小，但会减少历史记录。\")",
        ".setDesc(\"Maximum size of the history file in kilobytes, set to 0 for no limit. When over the size, edits will be deleted from the history in the next update, older edits first, reducing the edit history file size at the expense of less history.\")": ".setDesc(\"历史文件的最大大小（以千字节为单位），设置为 0 表示无限制。如果超过此大小，则下次更新时将从历史记录中删除编辑内容（先删除较旧的编辑内容），从而以较少的历史记录为代价减小编辑历史文件的大小。\")",
        ".setDesc(\"List of file extensions to store edits for. Empty to store edits for all files.\\nNote if an extension is removed, old edit history files will need to be removed manually.\")": ".setDesc(\"用于存储编辑的文件扩展名列表。如果为空则表示存储所有文件的编辑。\\n请注意，如果删除了扩展名，则需要手动删除旧的编辑历史文件。\")",
        ".setDesc(\"Show edit history file information on the status bar. Click the status bar to show the edit history for the current file.\")": ".setDesc(\"在状态栏上显示编辑历史文件信息。单击状态栏可显示当前文件的编辑历史。\")",
        ".setDesc(\"Messages to show in the javascript console.\")": ".setDesc(\"在 javascript 控制台中显示的消息。\")"
    }
}